isu-enterprise/hw-stm32-can-base/src/tft.c
Evgeny Cherkashin, [11.10.21 19:34]
/* mbed library for 240*320 pixel display TFT based on ILI9341 LCD Controller
 * Copyright (c) 2013, 2014 Peter Drescher - DC2PD
 * Special version for STM Nucleo -L152
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 * THE SOFTWARE.
 */

 // 24.06.14   initial version
 // 25.06.14   add Nucleo F103RB

// only include this file if target is L152 or F103RB :
#if defined TARGET_NUCLEO_L152RE || defined TARGET_NUCLEO_F103RB

#include "SPI_TFT_ILI9341.h"
#include "mbed.h"

#if defined TARGET_NUCLEO_L152RE
#include "stm32l1xx_dma.h"
#define use_ram
#endif

#if defined TARGET_NUCLEO_F103RB
#include "stm32f10x_dma.h"
#endif

#define BPP         16                  // Bits per pixel

//extern Serial pc;
//extern DigitalOut xx;     // debug !!

DMA_InitTypeDef DMA_InitStructure;


SPI_TFT_ILI9341::SPI_TFT_ILI9341(PinName mosi, PinName miso, PinName sclk, PinName cs, PinName reset, PinName dc, const char *name)
    : GraphicsDisplay(name), SPI(mosi,miso,sclk,NC), _cs(cs), _reset(reset), _dc(dc)
{

    format(8,3);                 // 8 bit spi mode 3
    // frequency(100000);         // 10 Mhz SPI clock : result 2 / 4 = 8
    orientation = 0;
    char_x = 0;
    if(_spi.spi == SPI_1){       // test which SPI is in use
         spi_num = 1;
    }
    if(_spi.spi == SPI_2){
         spi_num = 2;
    }
    #ifdef SPI_3                // there is no SPI 3 on all devices
    if(_spi.spi == SPI_3){
         spi_num = 3;
    }
    #endif
    tft_reset();
}

// we define a fast write to the SPI port
// we use the bit banding address to get the flag without masking

#define bit_SPI1_txe  *((volatile unsigned int *)0x42260104)
#define SPI1_DR       *((volatile unsigned int *)0x4001300C)
#define bit_SPI2_txe  *((volatile unsigned int *)0x42070104)
#define SPI2_DR       *((volatile unsigned int *)0x4000380C)
#define bit_SPI3_txe  *((volatile unsigned int *)0x42078104)
#define SPI3_DR       *((volatile unsigned int *)0x40003C0C)

void SPI_TFT_ILI9341::f_write(int data){

switch(spi_num){  // used SPI port
case (1):
    while(bit_SPI1_txe == 0);  // wait for SPI1->SR TXE flag
    SPI1_DR = data;
    break;

case (2):
    while( bit_SPI2_txe  == 0);  // wait for SPI2->SR TXE flag
    SPI2_DR = data;
    break;

case (3):
    while( bit_SPI3_txe == 0);  // wait for SPI3->SR TXE flag
    SPI3_DR = data;
    break;

    }
}

// wait for SPI not busy
// we have to wait for the last bit to switch the cs off
// we use the bit banding address to get the flag without masking

#define bit_SPI1_bsy  *((volatile unsigned int *)0x4226011C)
#define bit_SPI2_bsy  *((volatile unsigned int *)0x4207011C)
#define bit_SPI3_bsy  *((volatile unsigned int *)0x4207811C)

void inline SPI_TFT_ILI9341::spi_bsy(void){
switch(spi_num){        // decide which SPI is to use
case (1):
    while(bit_SPI1_bsy == 1);   // SPI1->SR bit 7
    break;

case (2):
    while(bit_SPI2_bsy == 1);   // SPI2->SR bit 7
    break;

case (3):
    while(bit_SPI3_bsy == 1);   // SPI2->SR bit 7
    break;
    }
}


// switch fast between 8 and 16 bit mode
#define bit_SPI1_dff  *((volatile unsigned int *)0x4226002C)
#define bit_SPI2_dff  *((volatile unsigned int *)0x4207002C)
#define bit_SPI3_dff  *((volatile unsigned int *)0x4207802C)
void SPI_TFT_ILI9341::spi_16(bool s){
switch(spi_num){        // decide which SPI is to use
case(1):
    if(s) bit_SPI1_dff = 1; // switch to 16 bit Mode
    else  bit_SPI1_dff = 0; // switch to 8  bit Mode
    break;

case(2):
    if(s) bit_SPI2_dff = 1; // switch to 16 bit Mode
    else  bit_SPI2_dff = 0; // switch to 8  bit Mode
    break;

Evgeny Cherkashin, [11.10.21 19:34]
case(3):
    if(s) bit_SPI3_dff = 1; // switch to 16 bit Mode
    else  bit_SPI3_dff = 0; // switch to 8  bit Mode
    break;
    }
}


int SPI_TFT_ILI9341::width()
{
    if (orientation == 0 || orientation == 2) return 240;
    else return 320;
}


int SPI_TFT_ILI9341::height()
{
    if (orientation == 0 || orientation == 2) return 320;
    else return 240;
}


void SPI_TFT_ILI9341::set_orientation(unsigned int o)
{
    orientation = o;
    wr_cmd(0x36);                     // MEMORY_ACCESS_CONTROL
    switch (orientation) {
        case 0:
            f_write(0x48);
            break;
        case 1:
            f_write(0x28);
            break;
        case 2:
            f_write(0x88);
            break;
        case 3:
            f_write(0xE8);
            break;
    }
    spi_bsy();    // wait for end of transfer
    _cs = 1;
    WindowMax();
}


// write command to tft register
// use fast command
void SPI_TFT_ILI9341::wr_cmd(unsigned char cmd)
{
    _dc = 0;
    _cs = 0;
    f_write(cmd);
    spi_bsy();
    _dc = 1;
}

void SPI_TFT_ILI9341::wr_dat(unsigned char dat)
{
   f_write(dat);
   spi_bsy();  // wait for SPI send
}

// the ILI9341 can read
char SPI_TFT_ILI9341::rd_byte(unsigned char cmd)
{
    // has to change !!
    return(0);
}

// read 32 bit
int SPI_TFT_ILI9341::rd_32(unsigned char cmd)
{
    // has to change !!!
    return(0);
}

int  SPI_TFT_ILI9341::Read_ID(void){
    int r;
    r = rd_byte(0x0A);
    r = rd_byte(0x0A);
    r = rd_byte(0x0A);
    r = rd_byte(0x0A);
    return(r);
}


// Init code based on MI0283QT datasheet
// this code is called only at start
// no need to be optimized

void SPI_TFT_ILI9341::tft_reset()
{
    _cs = 1;                           // cs high
    _dc = 1;                           // dc high
    _reset = 0;                        // display reset

    wait_us(50);
    _reset = 1;                       // end hardware reset
    wait_ms(5);

    wr_cmd(0x01);                     // SW reset
    wait_ms(5);
    wr_cmd(0x28);                     // display off

    /* Start Initial Sequence ----------------------------------------------------*/
    wr_cmd(0xCF);
    f_write(0x00);
    f_write(0x83);
    f_write(0x30);
    spi_bsy();
     _cs = 1;

     wr_cmd(0xED);
     f_write(0x64);
     f_write(0x03);
     f_write(0x12);
     f_write(0x81);
     spi_bsy();
     _cs = 1;

     wr_cmd(0xE8);
     f_write(0x85);
     f_write(0x01);
     f_write(0x79);
     spi_bsy();
     _cs = 1;

