isu-enterprise/hw-stm32-can-base/src/tft.c
     wr_cmd(0xCB);
     f_write(0x39);
     f_write(0x2C);
     f_write(0x00);
     f_write(0x34);
     f_write(0x02);
     spi_bsy();
     _cs = 1;

     wr_cmd(0xF7);
     f_write(0x20);
     spi_bsy();
     _cs = 1;

     wr_cmd(0xEA);
     f_write(0x00);
     f_write(0x00);
     spi_bsy();
     _cs = 1;

     wr_cmd(0xC0);                     // POWER_CONTROL_1
     f_write(0x26);
     spi_bsy();
     _cs = 1;

     wr_cmd(0xC1);                     // POWER_CONTROL_2
     f_write(0x11);
     spi_bsy();
     _cs = 1;

     wr_cmd(0xC5);                     // VCOM_CONTROL_1
     f_write(0x35);
     f_write(0x3E);
     spi_bsy();
     _cs = 1;

     wr_cmd(0xC7);                     // VCOM_CONTROL_2
     f_write(0xBE);
     spi_bsy();
     _cs = 1;

     wr_cmd(0x36);                     // MEMORY_ACCESS_CONTROL
     f_write(0x48);
     spi_bsy();
     _cs = 1;

     wr_cmd(0x3A);                     // COLMOD_PIXEL_FORMAT_SET
     f_write(0x55);                 // 16 bit pixel
     spi_bsy();
     _cs = 1;

     wr_cmd(0xB1);                     // Frame Rate
     f_write(0x00);
     f_write(0x1B);
     spi_bsy();
     _cs = 1;

     wr_cmd(0xF2);                     // Gamma Function Disable
     f_write(0x08);
     spi_bsy();
     _cs = 1;

     wr_cmd(0x26);
     f_write(0x01);                 // gamma set for curve 01/2/04/08
     spi_bsy();
     _cs = 1;

     wr_cmd(0xE0);                     // positive gamma correction
     f_write(0x1F);
     f_write(0x1A);
     f_write(0x18);
     f_write(0x0A);
     f_write(0x0F);
     f_write(0x06);
     f_write(0x45);
     f_write(0x87);
     f_write(0x32);
     f_write(0x0A);
     f_write(0x07);
     f_write(0x02);
     f_write(0x07);
     f_write(0x05);
     f_write(0x00);
     spi_bsy();
     _cs = 1;

     wr_cmd(0xE1);                     // negativ gamma correction
     f_write(0x00);
     f_write(0x25);
     f_write(0x27);
     f_write(0x05);
     f_write(0x10);
     f_write(0x09);
     f_write(0x3A);
     f_write(0x78);
     f_write(0x4D);
     f_write(0x05);
     f_write(0x18);
     f_write(0x0D);
     f_write(0x38);
     f_write(0x3A);
     f_write(0x1F);
     spi_bsy();
     _cs = 1;

     WindowMax ();

     //wr_cmd(0x34);                     // tearing effect off
     //_cs = 1;

     //wr_cmd(0x35);                     // tearing effect on
     //_cs = 1;

     wr_cmd(0xB7);                       // entry mode
     f_write(0x07);
     spi_bsy();
     _cs = 1;

     wr_cmd(0xB6);                       // display function control
     f_write(0x0A);
     f_write(0x82);
     f_write(0x27);
     f_write(0x00);
     spi_bsy();
     _cs = 1;

     wr_cmd(0x11);                     // sleep out
     spi_bsy();
     _cs = 1;

     wait_ms(100);

     wr_cmd(0x29);                     // display on
     spi_bsy();
     _cs = 1;

     wait_ms(100);

    //    Configure the DMA controller init-structure
    DMA_StructInit(&DMA_InitStructure);
    switch(spi_num){        // decide which SPI is to use
    case (1):
        RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA1, ENABLE);    // SPI1 and SPI2 are using DMA 1
        DMA_InitStructure.DMA_PeripheralBaseAddr  = (uint32_t) &(SPI1->DR);
        break;
    case (2):
        RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA1, ENABLE);    // SPI1 and SPI2 are using DMA 1
        DMA_InitStructure.DMA_PeripheralBaseAddr  = (uint32_t) &(SPI2->DR);
        break;
    case (3):
        RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA2, ENABLE);    // SPI3 is using DMA 2
        DMA_InitStructure.DMA_PeripheralBaseAddr  = (uint32_t) &(SPI3->DR);
        break;
    }
    DMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralDST;
    DMA_InitStructure.DMA_M2M = DMA_M2M_Disable;
    DMA_InitStructure.DMA_BufferSize  = 0;
    DMA_InitStructure.DMA_PeripheralInc  = DMA_PeripheralInc_Disable;
    DMA_InitStructure.DMA_PeripheralDataSize  = DMA_PeripheralDataSize_HalfWord;
    DMA_InitStructure.DMA_MemoryDataSize  = DMA_MemoryDataSize_HalfWord;
    DMA_InitStructure.DMA_Mode  = DMA_Mode_Normal;
    DMA_InitStructure.DMA_Priority  = DMA_Priority_High;
 }


// speed optimized
// write direct to SPI1 register !
void SPI_TFT_ILI9341::pixel(int x, int y, int color)
{
    wr_cmd(0x2A);
    spi_16(1);         // switch to 8 bit Mode
    f_write(x);
    spi_bsy();
    _cs = 1;

    spi_16(0);        // switch to 8 bit Mode
    wr_cmd(0x2B);
    spi_16(1);
    f_write(y);
    spi_bsy();
    _cs = 1;
    spi_16(0);

    wr_cmd(0x2C); // send pixel
    spi_16(1);
    f_write(color);
    spi_bsy();
    _cs = 1;
    spi_16(0);
}

// optimized
// write direct to SPI1 register !
void SPI_TFT_ILI9341::window (unsigned int x, unsigned int y, unsigned int w, unsigned int h)
{
    wr_cmd(0x2A);
    spi_16(1);
    f_write(x);
    f_write(x+w-1);
    spi_bsy();
    _cs = 1;
    spi_16(0);

    wr_cmd(0x2B);
    spi_16(1);
    f_write(y) ;
    f_write(y+h-1);
    spi_bsy();
    _cs = 1;
    spi_16(0);
}


void SPI_TFT_ILI9341::WindowMax (void)
{
    window (0, 0, width(),  height());
}

// optimized
// use DMA to transfer pixel data to the screen
void SPI_TFT_ILI9341::cls (void)
{
    // we can use the fillrect function
   fillrect(0,0,width()-1,height()-1,_background);
}

void SPI_TFT_ILI9341::circle(int x0, int y0, int r, int color)
{

Evgeny Cherkashin, [11.10.21 19:34]
int x = -r, y = 0, err = 2-2*r, e2;
    do {
        pixel(x0-x, y0+y,color);
        pixel(x0+x, y0+y,color);
        pixel(x0+x, y0-y,color);
        pixel(x0-x, y0-y,color);
        e2 = err;
        if (e2 <= y) {
            err += ++y*2+1;
            if (-x == y && e2 <= x) e2 = 0;
        }
        if (e2 > x) err += ++x*2+1;
    } while (x <= 0);
}

void SPI_TFT_ILI9341::fillcircle(int x0, int y0, int r, int color)
{
    int x = -r, y = 0, err = 2-2*r, e2;
    do {
        vline(x0-x, y0-y, y0+y, color);
        vline(x0+x, y0-y, y0+y, color);
        e2 = err;
        if (e2 <= y) {
            err += ++y*2+1;
            if (-x == y && e2 <= x) e2 = 0;
        }
        if (e2 > x) err += ++x*2+1;
    } while (x <= 0);
}


// optimized for speed
void SPI_TFT_ILI9341::hline(int x0, int x1, int y, int color)
{
    int w,j;
    w = x1 - x0 + 1;
    window(x0,y,w,1);
    _dc = 0;
    _cs = 0;
    f_write(0x2C); // send pixel
    spi_bsy();
    _dc = 1;
    spi_16(1);

    for (j=0; j<w; j++) {
        f_write(color);
    }
    spi_bsy();
    spi_16(0);
    _cs = 1;
    WindowMax();
    return;
}

// optimized for speed
void SPI_TFT_ILI9341::vline(int x, int y0, int y1, int color)
{
    int h,y;
    h = y1 - y0 + 1;
    window(x,y0,1,h);
    _dc = 0;
    _cs = 0;
    f_write(0x2C); // send pixel
    spi_bsy();
    _dc = 1;
    spi_16(1);
                // switch to 16 bit Mode 3
    for (y=0; y<h; y++) {
        f_write(color);
    }
    spi_bsy();
    spi_16(0);
    _cs = 1;
    WindowMax();
    return;
}


